## <font face='comic sans ms' color ='yellow'>mysql python</font>

In [ ]:
import mysql.connector as con

In [ ]:
mydb=con.connect(host='localhost',user='root',passwd='12345')
mydb.is_connected()

In [ ]:
mycursor=mydb.cursor()
mycursor.execute('show databases')

In [ ]:
for row in mycursor:
    print(row)

In [ ]:
mydb=con.connect(host='localhost',user='root',passwd='12345',database='semester6_db')
mydb.is_connected()

In [ ]:
mycursor=mydb.cursor()
mycursor.execute('select * from course')

In [ ]:
for row in mycursor:
    print(row)

## <font face='comic sans ms' color ='yellow'>Reading csv file and creating table with its data</font>

In [1]:
def readCsvFile(filePath):
    import csv
    with open(filePath) as f:
        tab_reader=csv.reader(f,delimiter=',')
        return list(tab_reader)[1:]
        # for row in tab_reader:
        #     print(row)
        #     # break

In [10]:
print(len(readCsvFile('resources/books.csv')))

211

In [2]:
import mysql.connector as con
mydb=con.connect(host='localhost',user='root',passwd='12345')
mydb.is_connected()

True

In [3]:
mycursor=mydb.cursor()
try:
    mycursor.execute('create database book_db')
    print('database book_db successfully created...')
except:
    print('error occured')
mycursor.execute('show databases')
print('list of databases are')
print(list(mycursor))

error occured
list of databases are
[('book_db',), ('information_schema',), ('mysql',), ('performance_schema',), ('sakila',), ('semester6_db',), ('studentdb',), ('sys',), ('world',)]

In [4]:
mycursor.execute('use book_db')
print(mycursor)

CMySQLCursor: use book_db

In [5]:
mycursor.execute('create table Book(Book_id serial primary key, Title varchar(50), Author varchar(30), Genre varchar(30), Height int, Publisher varchar(50))')
print(mycursor)

ProgrammingError: 1050 (42S01): Table 'book' already exists

In [6]:
mycursor.execute('show tables')
for table in mycursor:
    print(table[0])

book

In [19]:
def insert(listOfData,mycursor):
    c=0
    for row in listOfData:
        for i in range(len(row)):
            if row[i]=='': row[i]='null'
        Title,Author,Genre,Height,Publisher=row
        query=f"INSERT into book(Title,Author,Genre,Height,Publisher) values('{Title}','{Author}','{Genre}',{Height},'{Publisher}')"
        try:
            mycursor.execute(query)
            c+=1
        except Exception as e:
            print(e)
            print(query)
    print(c,'values inserted')

In [22]:
insert(readCsvFile('resources/books.csv'),mycursor)

1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 's Walk, The','Mlodinow, Leonard','science',197,'Penguin')' at line 1
INSERT into book(Title,Author,Genre,Height,Publisher) values('Drunkard's Walk, The','Mlodinow, Leonard','science',197,'Penguin')
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'Pratt, John','data_science',236,'MIT Press')' at line 1
INSERT into book(Title,Author,Genre,Height,Publisher) values('Statistical Decision Theory'','Pratt, John','data_science',236,'MIT Press')
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'Reilly')' at line 1
INSERT into book(Title,Author,Genre,Height,Publisher) values('Making Software','Oram, Andy','computer_science',232,'O'Reilly')
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'Reilly')' at line 1
INSERT into book(Title,Author,Genre,Height,Publisher) values('Machine Learning for Hackers','Conway, Drew','data_science',233,'O'Reilly')
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'Reilly')' at line 1
INSERT into book(Title,Author,Genre,Height,Publisher) values('Python for Data Analysis','McKinney, Wes','data_science',233,'O'Reilly')
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 're Joking Mr Feynman','Feynman, Richard','science',198,'Random House')' at line 1
INSERT into book(Title,Author,Genre,Height,Publisher) values('Surely You're Joking Mr Feynman','Feynman, Richard','science',198,'Random House')
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'Reilly')' at line 1
INSERT into book(Title,Author,Genre,Height,Publisher) values('Learning OpenCV','Bradsky, Gary','data_science',232,'O'Reilly')
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 's Men','Woodward, Bob','history',177,'Random House')' at line 1
INSERT into book(Title,Author,Genre,Height,Publisher) values('All the President's Men','Woodward, Bob','history',177,'Random House')
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 's Greatest Trials, The','null','history',210,'null')' at line 1
INSERT into book(Title,Author,Genre,Height,Publisher) values('World's Greatest Trials, The','null','history',210,'null')
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 's Greatest Short Stories, The','null','fiction',217,'Jaico')' at line 1
INSERT into book(Title,Author,Genre,Height,Publisher) values('World's Greatest Short Stories, The','null','fiction',217,'Jaico')
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 's Collected Short Stories, Vol 3','Maugham, William S','fiction',171,'Vintage')' at line 1
INSERT into book(Title,Author,Genre,Height,Publisher) values('Maugham's Collected Short Stories, Vol 3','Maugham, William S','fiction',171,'Vintage')
1406 (22001): Data too long for column 'Title' at row 1
INSERT into book(Title,Author,Genre,Height,Publisher) values('Clash of Civilizations and Remaking of the World Order','Huntington, Samuel','history',228,'Simon&Schuster')
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 's Journey','null','comic',258,'null')' at line 1
INSERT into book(Title,Author,Genre,Height,Publisher) values('Justice League: The Villain's Journey','null','comic',258,'null')
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 's Tooth','Rutherford, Alex','history',180,'null')' at line 1
INSERT into book(Title,Author,Genre,Height,Publisher) values('Empire of the Mughal - The Serpent's Tooth','Rutherford, Alex','history',180,'null')
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 's Advocate, The','West, Morris','fiction',178,'null')' at line 1
INSERT into book(Title,Author,Genre,Height,Publisher) values('Devil's Advocate, The','West, Morris','fiction',178,'null')
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 's Great Thinkers, The','null','philosophy',189,'null')' at line 1
INSERT into book(Title,Author,Genre,Height,Publisher) values('World's Great Thinkers, The','null','philosophy',189,'null')
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 's Brain','Sagan, Carl','science',174,'null')' at line 1
INSERT into book(Title,Author,Genre,Height,Publisher) values('Broca's Brain','Sagan, Carl','science',174,'null')
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 's Legal System','Nariman','nonfiction',177,'null')' at line 1
INSERT into book(Title,Author,Genre,Height,Publisher) values('India's Legal System','Nariman','nonfiction',177,'null')
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 's Nest','Larsson, Steig','fiction',179,'null')' at line 1
INSERT into book(Title,Author,Genre,Height,Publisher) values('Girl who kicked the Hornet's Nest','Larsson, Steig','fiction',179,'null')
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 's Law','null','nonfiction',178,'null')' at line 1
INSERT into book(Title,Author,Genre,Height,Publisher) values('Murphy's Law','null','nonfiction',178,'null')
191 values inserted

In [13]:
def showRows(table,mycursor):
    mycursor.execute(f'select * from {table}')
    for row in mycursor:
        print(row)

In [21]:
showRows('book',mycursor)

In [20]:
mycursor.execute('delete from book')